Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.LocationBy Property
 Gets or sets the location by attribute. Value is ViewAttributes.LocationByModelOrigin, ViewAttributes.LocationByProjectBasePoint or guid of a Basepoint.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string LocationBy { get; set; }
Public Property LocationBy As String
	Get
	Set
Property Value
Type: String
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace